[
  {
    "id": 1,
    "title": "Правда о деле Гарри Квеберта",
    "description": "“Правда о деле Гарри Квеберта” вышла в 2012 году и сразу стала бестселлером. Едва появившись на прилавках, книга в одной только Франции разошлась огромным тиражом и была переведена на тридцать языков, а ее автор, двадцатисемилетний швейцарец Жоэль Диккер, получил Гран-при Французской академии за лучший роман и Гонкуровскую премию лицеистов.\n\nДействие этой истории с головокружительным сюжетом и неожиданным концом происходит в США. Молодой успешный романист Маркус Гольдман мается от отсутствия вдохновения и отправляется за помощью к своему учителю, знаменитому писателю Гарри Квеберту. Однако внезапно выясняется, что помощь требуется самому Гарри, обвиненному в убийстве, которое произошло в тихом американском городке 33 года назад.\n\nЧтобы спасти Гарри от электрического стула, Маркус берется за собственное расследование и пытается распутать сложнейший клубок лжи, давно похороненных тайн и роковых случайностей. И получает тридцать один совет, как написать бестселлер.",
    "price": 1315,
    "status": "В наличии",
    "author": "Жоэль Диккер",
    "category": "Художественная литература",
    "rating": 4,
    "img": "assets/images/ygn07z20s0y7pmqy1scg2l9mj2n81w3u.jpg",
    "discount": 10
  },
  {
    "id": 2,
    "title": "Мастер и Маргарита",
    "description": "“Бессмертное, загадочное и остроумное «Евангелие от Сатаны» Михаила Булгакова.\nРоман, уникальный в российской литературе ХХ столетия. Трудно себе представить, какое влияние он оказал на мировую культуру.\nНа основе «Мастера и Маргариты» снимались и продолжают сниматься фильмы и телесериалы, это произведение легло в основу оперы, симфонии, рок-оперы, его иллюстрировали самые знаменитые художники и фотографы.",
    "price": 349,
    "status": "В наличии",
    "author": "Михаил Булгаков",
    "category": "Художественная литература",
    "rating": 5,
    "img": "assets/images/6271333998.jpg",
    "discount": 2
  },
  {
    "id": 3,
    "title": "1984",
    "description": "“Культовый роман Джорджа Оруэлла, одна из главных антиутопий XX века.\nЖуткий и пугающий текст, и 70 лет спустя не утративший актуальности.\nВпервые «1984» публикуется на русском языке в новом, полном, без цензуры и купюр, переводе Дарьи Целовальниковой. ",
    "price": 400,
    "status": "В наличии",
    "author": "Джордж Оруэлл",
    "category": "Художественная литература",
    "rating": 4,
    "img": "assets/images/6353881258.jpg",
    "discount": 3
  },
  {
    "id": 4,
    "title": "Преступление и наказание",
    "description": "“Преступление и наказание\" (1866) — одно из самых значительных произведений в истории мировой литературы. Это и глубокий филососфский роман, и тонкая психологическая драма, и захватывающий детектив, и величественная картина мрачного города, в недрах которого герои грешат и ищут прощения, жертвуют собой и отрекаются от себя ради ближних и находят успокоение в смирении, покаянии, вере. Главный герой романа Родион Раскольников решается на убийство, чтобы доказать себе и миру, что он не \"тварь дрожащая\", а \"право имеет\". Главным предметом исследования писателя становится процесс превращения добропорядочного, умного и доброго юноши в убийцу, а также то, как совершивший преступление Раскольников может искупить свою вину. ",
    "price": 388,
    "status": "В наличии",
    "author": "Федор Достоевский",
    "category": "Художественная литература",
    "rating": 4,
    "img": "assets/images/6136076025.jpg",
    "discount": 7
  },
  {
  "id": 5,
  "title": "Герой нашего времени",
  "description": "«Герой нашего времени» (1840) по праву считается первым психологическим романом в русской литературе.\nВ основе повествования — история жизни главного героя, Григория Печорина. Произведение состоит из пяти частей, расположенных не в хронологическом порядке, однако в этом есть своя логика. Писатель постепенно начинает погружать читателя во внутренний мир его героя, циника, прожигателя жизни, ни во что не верящего, противоречивого и неоднозначного.\nПри всем при этом «Герой нашего времени» — это и философское произведение, ставящее перед читателем важнейшие вопросы о смысле жизни, о роли фатума; это еще и любовный роман, увлекательный, волнующий и трагический.\nНаписанный в позапрошлом веке «Герой нашего времени», не теряет своей актуальности, потому что в каждом поколении есть свои герои, свои Печорины, свои «лишние люди».",
  "price": 347,
  "status": "В наличии",
  "author": "Михаил Лермонтов",
  "category": "Художественная литература",
  "rating": 5,
  "img": "assets/images/7058732687.jpg",
  "discount": 10
},
  {
  "id": 6,
  "title": "На Западном фронте без перемен",
  "description": "Говоря о Первой мировой войне, всегда вспоминают одно произведение Эриха Марии Ремарка.\n«На Западном фронте без перемен».\nЭто рассказ о немецких мальчишках, которые под действием патриотической пропаганды идут на войну, не зная о том, что впереди их ждет не слава героев, а инвалидность и смерть…\nКаждый день войны уносит жизни чьих-то отцов, сыновей, а газеты тем временем бесстрастно сообщают: \"На Западном фронте без перемен...\".\nЭта книга — не обвинение, не исповедь.\nЭто попытка рассказать о поколении, которое погубила война, о тех, кто стал ее жертвой, даже если сумел спастись от снарядов и укрыться от пули. ",
  "price": 435,
  "status": "В наличии",
  "author": "Эрих Ремарк",
  "category": "Художественная литература",
  "rating": 4,
  "img": "assets/images/101163476_0.jpg",
  "discount": 15
},
  {
  "id": 7,
  "title": "Мертвые души",
  "description": "Поэма \"Мертвые души\" еще при жизни автора была переведена на множество других языков. Она имела невероятный успех. Никому до Гоголя и после него не удавалось так ярко и остро описать пороки и слабости русского человека, так живо и правдиво отразить важнейшие для России проблемы. Прошло 160 лет, и поэма звучит как только что написанная. Чичиковы, Коробочки, Ноздревы, Плюшкины, Собакевичи — их стремления, чувства, поступки не кажутся нам отголосками прошлого. Современное и острое звучание эти персонажи обретают, когда мы смотрим все новые и новые спектакли и фильмы по этой бессмертной поэме. ",
  "price": 359,
  "status": "В наличии",
  "author": "Николай Гоголь",
  "category": "Художественная литература",
  "rating": 5,
  "img": "assets/images/6729744189.jpg",
  "discount": 20
},
  {
  "id": 8,
  "title": "Маленький принц",
  "description": "«Маленький принц» — наиболее известное (переведено более чем на 180 языков) произведение Экзюпери, написанное незадолго до смерти автора и им же проиллюстрированное.\nЭта печальная, мудрая, человечная сказка предназначена, скорее, взрослым, чем детям. В ней рассказано о самом важном: о дружбе и любви, о долге и верности…Читая эту чудесную историю, и улыбнешься, и взгрустнешь, и непременно задумаешься, над тем, что не всегда можно понять разумом… Как говорил Маленький принц — «увидишь сердцем».\nВ издание также включен сборник эссе «Планета людей». ",
  "price": 365,
  "status": "В наличии",
  "author": "Антуан де Сент-Экзюпери",
  "category": "Художественная литература",
  "rating": 3,
  "img": "assets/images/6711107245.jpg",
  "discount": 30
},
  {
  "id": 9,
  "title": "Повелитель мух",
  "description": "\"Повелитель мух\".\nСтранная, страшная и бесконечно притягательная книга.\nИстория благовоспитанных мальчиков, внезапно оказавшихся на необитаемом острове.\nФилософская притча о том, что может произойти с людьми, забывшими о любви и милосердии.\nГротескная антиутопия, роман-предупреждение и, конечно, напоминание о хрупкости мира, в котором живем мы все. ",
  "price": 447,
  "status": "В наличии",
  "author": "Уильям Голдинг",
  "category": "Художественная литература",
  "rating": 4,
  "img": "assets/images/6666099345.jpg",
  "discount": 10
},
  {
  "id": 10,
  "title": "Вишневый сад",
  "description": " Главным достоинством всех чеховских пьес и его новаторством было то, что он впервые сделал предметом исследования мельчайшие детали быта и жизни людей. Он описывал повседневность, и именно через нее читатель узнает о мыслях и чувствах героев. За внешним отсутствием действия скрывается напряженная психологическая жизнь ее персонажей. «Пусть на сцене все будет так же сложно и так же вместе с тем просто, как в жизни. Люди обедают, только обедают, а в это время слагается их счастье и разбиваются их жизни» – это слова самого Чехова.\nМожно бесконечно перечитывать чеховскую драматургию, каждый раз открывая в ней что-то новое, – режиссеры всего мира обращаются к его пьесам за поиском нового содержания и новых форм. ",
  "price": 359,
  "status": "В наличии",
  "author": "Антон Чехов",
  "category": "Художественная литература",
  "rating": 5,
  "img": "assets/images/6301352899.jpg",
  "discount": 25
},
  {
  "id": 11,
  "title": "Пикник на обочине",
  "description": "Пожалуй, в истории современной мировой фантастики найдется не так много произведений, которые оставались бы популярными столь долгое время. Повесть послужила основой культового фильма Тарковского «Сталкер»; через три десятилетия появились не менее культовая компьютерная игра с тем же названием и целая серия повестей и романов, написанных с использованием мира «Пикника».",
  "price": 435,
  "status": "В наличии",
  "author": "Аркадий и Борис Стругацкие",
  "category": "Научная фантастика",
  "rating": 5,
  "img": "assets/images/018fa1c1-70be-7d03-94a8-87a88117c74a.jpg",
  "discount": 13
},
  {
  "id": 12,
  "title": "Дюна",
  "description": "Десять цветных иллюстраций художника Дмитрия Андреева\nКарта Арракиса на форзаце и нахзаце\nПостер на обратной стороне суперобложки\nОдин из самых культовых научно-фантастических романов всех времён и народов.\n\nФрэнк Герберт (1920-1986) успел написать много, но в истории остался прежде всего как автор эпопеи «Дюна». Возможно, самой прославленной фантастической саги двадцатого столетия, саги, переведенной на десятки языков и завоевавшей по всему миру миллионы поклонников. Самый авторитетный журнал научной фантастики «Локус» признал «Дюну», первый роман эпопеи о песчаной планете, лучшим научно-фантастическим романом всех времен и народов. В «Дюне» Фрэнку Герберту удалось совершить невозможное — создать своеобразную «хронику далекого будущего». И не было за всю историю мировой фантастики картины грядущего более яркой, более зримой, более мощной и оригинальной.",
  "price": 1439,
  "status": "В наличии",
  "author": "Фрэнк Герберт",
  "category": "Научная фантастика",
  "rating": 5,
  "img": "assets/images/6815003926.jpg",
  "discount": 10
}
,
  {
    "id": 13,
    "title": "Солярис",
    "description": "«Солярис» - бесспорная вершина творчества Станислава Лема, произведение, повлиявшее на развитие научной фантастики XX века, в том числе и на русскую фантастику. Роман дважды экранизирован, по нему были поставлены радиопьесы, спектакли – и даже балет!\nИтак, что же такое – Солярис? Бескрайний мыслящий океан, преследующий непонятные человеку цели, тончайший камертон, преобразующий людские чувства в материальную форму? Воплощенный кошмар психолога или духовный целитель? Со дня публикации книги прошло больше 50 лет, а ее читатели все так же продолжают задаваться вопросами, ответы на которые невозможно получить, не заглянув в свое собственное сердце.",
    "price": 459,
    "status": "В наличии",
    "author": "Станислав Лем",
    "category": "Научная фантастика",
    "rating": 4,
    "img": "assets/images/1031742110.jpg",
    "discount": 15
  },
  {
    "id": 14,
    "title": "451' по Фаренгейту",
    "description": "Философская антиутопия Брэдбери рисует беспросветную картину развития постиндустриального общества: это мир будущего, в котором все письменные издания безжалостно уничтожаются специальным отрядом пожарных, а хранение книг преследуется по закону, интерактивное телевидение успешно служит всеобщему оболваниванию, карательная психиатрия решительно разбирается с редкими инакомыслящими, а на охоту за неисправимыми диссидентами выходит электрический пес…\nРоман, принесший своему творцу мировую известность.\nСенсационным было заявление Брэдбери в 2007 году, что «451° по Фаренгейту» понимают неправильно. Эта книга не о правительственной цензуре, это история о том, как телевидение уничтожает интерес к чтению книг.\nВ начале 1950-х большинство американцев в глаза не видело телевизора, однако Брэдбери предсказал наступление новой эры свободы, достатка и развлечений, когда желание быть счастливым, помноженное на политкорректность, приведет к запрету книг.\n\n«Телевизор говорит вам, о чем надлежит думать, и вколачивает это вам в голову. Он всегда и обязательно прав».",
    "price": 447,
    "status": "В наличии",
    "author": "Рэй Брэдбери",
    "category": "Научная фантастика",
    "rating": 4,
    "img": "assets/images/7188103243.jpg",
    "discount": 10
  },
  {
    "id": 15,
    "title": "Некрономикон. Книга запретных тайн",
    "description": "Причудливые, полные ужаса истории, вошедшие в этот сборник, расскажут о тех, кто вкусил из ядовитой чаши запретных знаний - \"Некрономикона\" - и в полной мере ощутил последствия этого шага. Но Лавкрафт, как ни странно, создавал и другие рассказы - уютные, насмешливо-пародийные, полные дружеского тепла по отношению к своим собратьям по перу: Кларку Э. Смиту, Августу Дерлету, Роберту Говарду и другим, хотя со многими из них он никогда в жизни не встречался...",
    "price": 412,
    "status": "В наличии",
    "author": "Говард Филлипс Лавкрафт",
    "category": "Научная фантастика",
    "rating": 3,
    "img": "assets/images/101081812_0.jpg",
    "discount": 20
  },
  {
    "id": 16,
    "title": "Война миров",
    "description": "В книгу вошел легендарный роман Герберта Уэллса \"Война миров\", многократно экранизированный и вдохновляющий целые поколения писателей-фантастов на создание захватывающих произведений о борьбе цивилизаций и звездных войнах.",
    "price": 365,
    "status": "В наличии",
    "author": "Герберт Уэллс",
    "category": "Научная фантастика",
    "rating": 5,
    "img": "assets/images/6152956687.jpg",
    "discount": 10
  },
  {
    "id": 17,
    "title": "Метро 2035",
    "description": "«Метро 2035» – завершение культовой трилогии. В этом романе сюжетные линии предыдущих книг соединятся. Мы возвращаемся к герою Артему, который живет на родной станции и каждый день выбирается на поверхность в надежде поймать сигнал от выживших за пределами метро. Его считают сумасшедшим, но он одержим поиском доказательств. Это безумное стремление открыть населению метро истину приводит его на новый опасный путь.\nВ этой книге нам покажут расцвет тоталитарной и страшной системы власти подземки, неофашисты начнут делить людей на здоровых и уродов, назревает новая война.\nЖители Москвы живут в мифе, что они единственные выжившие на планете, и Артем вместе с соратниками рискует жизнью, чтобы наладить связь с другими городами.",
    "price": 1769,
    "status": "В наличии",
    "author": "Дмитрий Глуховский",
    "category": "Научная фантастика",
    "rating": 4,
    "img": "assets/images/6011372352.jpg",
    "discount": 15
  },
  {
    "id": 18,
    "title": "Сами боги",
    "description": "В двадцать втором веке Земля получает безграничную, бесплатную энергию из источника, природу которого ученые не могут объяснить: инопланетная разработка по обмену энергией с параллельной вселенной. Но все имеет свою цену. Сам процесс переноса приведет к разрушению Солнца — и самой Земли.\nЛишь немногие знают ужасающую правду — земной ученый-изгой, инопланетянин с умирающей планеты и человек, родившийся на Луне, который интуитивно чувствует неминуемое уничтожение Солнца. Они знают правду и у них есть ключ к спасению Земли, но кто будет их слушать, кто им поверит?",
    "price": 739,
    "status": "В наличии",
    "author": "Айзек Азимов",
    "category": "Научная фантастика",
    "rating": 3,
    "img": "assets/images/1014962729.jpg",
    "discount": 10
  },
  {
    "id": 19,
    "title": "Зеленая миля",
    "description": "Стивен Кинг приглашает читателей в жуткий мир тюремного блока смертников, откуда уходят, чтобы не вернуться, приоткрывает дверь последнего пристанища тех, кто преступил не только человеческий, но и Божий закон. По эту сторону электрического стула нет более смертоносного местечка! Ничто из того, что вы читали раньше, не сравнится с самым дерзким из ужасных опытов Стивена Кинга - с историей, что начинается на Дороге Смерти и уходит в глубины самых чудовищных тайн человеческой души...",
    "price": 742,
    "status": "В наличии",
    "author": "Стивен Кинг",
    "category": "Научная фантастика",
    "rating": 5,
    "img": "assets/images/6012332467.jpg",
    "discount": 5
  },
  {
    "id": 20,
    "title": "Человек-амфибия",
    "description": "Роман, послуживший основой для культового одноименного фильма, который прекрасно знают многие поколения российских зрителей.\nИдут годы и десятилетия – но увлекательная, трогательная история юного Ихтиандра, который в результате дерзкого эксперимента профессора Сальватора обрел способность жить и на земле, и в воде, рассказ о его опасных приключениях в «мире людей» и его любви к красавице Гуттиэре по-прежнему захватывает своей живостью и эмоциональностью.",
    "price": 365,
    "status": "В наличии",
    "author": "Александр Беляев\n",
    "category": "Научная фантастика",
    "rating": 3,
    "img": "assets/images/7147067585.jpg",
    "discount": 20
  },
  {
    "id": 21,
    "title": "Последнее желание. Меч предназначения",
    "description": "Новеллы о ведьмаке Геральте из Ривии, его друзьях и недругах,\nо смертельно опасной его «работе» по истреблению кровожадной нечисти, о мире, в котором среди обычных людей живут эльфы, гномы, оборотни и драконы, давно стали классикой...\n\nСага Анджея Сапковского занимает одно из первых мест в отечественных и зарубежных списках лучшего фэнтези, а Геральт, культовый персонаж литературы и компьютерных игр, уже во второй раз появляется на телеэкранах.\nСмотрите экранизацию великолепной саги и сравнивайте приключения любимого героя в кинематографическом и литературном мирах!",
    "price": 1186,
    "status": "В наличии",
    "author": "Анджей Сапковский",
    "category": "Фэнтези",
    "rating": 5,
    "img": "assets/images/6040709745.jpg",
    "discount": 10
  },
  {
    "id": 22,
    "title": "Сильмариллион",
    "description": "Джон Рональд Руэл Толкин (3.01.1892—2.09.1973) — писатель, поэт, филолог, профессор Оксфордского университета, родоначальник современной фэнтези. В 1937 году был написан «Хоббит», а в середине 1950-х годов увиделисвет три книги «Властелина Колец», повествующие о Средиземье — мире, населенном представителями волшебных рас со сложной культурой, историей и мифологией.В последующие годы эти романы были переведены на все мировые языки, адаптированы для кино, мультипликации, аудиопьес, театра, компьютерных игр, комиксов и породили массу подражаний и пародий.\n\n\"Сильмариллион\" – один из масштабнейших миров в истории фэнтези, мифологический канон, который Джон Руэл Толкин составлял на протяжении всей жизни. Свел же разрозненные фрагменты воедино, подготовив текст к публикации, сын Толкина Кристофер. В 1996 году он поручил художнику-иллюстратору Теду Несмиту нарисовать серию цветных произведений для полноцветного издания.",
    "price": 1651,
    "status": "В наличии",
    "author": "Джон Рональд Руэл Толкин",
    "category": "Фэнтези",
    "rating": 5,
    "img": "assets/images/10503121_0.jpg",
    "discount": 10
  },
  {
    "id": 23,
    "title": "Хоббит",
    "description": "Джон Рональд Руэл Толкин (3.01.1892 – 2.09.1973) – писатель, поэт, филолог, профессор Оксфордского университета, родоначальник\nсовременной фэнтези. В 1937 году был написан «Хоббит», а в середине 1950-х годов увидели свет три книги «Властелина колец», повествующие\nо Средиземье – мире, населенном представителями волшебных рас со сложной культурой, историей и мифологией.\nВ последующие годы эти романы были переведены на все мировые языки, адаптированы для кино, мультипликации, аудиопьес, театра,\nкомпьютерных игр, комиксов и породили массу подражаний и пародий.\nАлан Ли (р. 20.08.1947) – художник-иллюстратор десятков книг в жанре фэнтези. Наибольшую известность приобрели его обложки и\nиллюстрации к произведениям Джона Р.Р. Толкина: «Хоббит», «Властелин Колец», «Дети Хурина». Также иллюстрировал трилогию «Горменгаст»\nМервина Пика, цикл средневековых валлийских повестей «Мабиногион» и многое другое",
    "price": 1415,
    "status": "В наличии",
    "author": "Джон Рональд Руэл Толкин",
    "category": "Фэнтези",
    "rating": 5,
    "img": "assets/images/1017910660.jpg",
    "discount": 10
  },
  {
    "id": 24,
    "title": "Властелин Колец",
    "description": "Международный бестселлер. Одна из самых известных книг XX века. Один из родоначальников жанра фэнтези.\nЛитературная основа кинотрилогии Питера Джексона.\nУвлекательная история о силе добра и борьбе с абсолютным злом.\nВсё это и многое больше — «Властелин колец».\nВ данном издании все три части публикуются под одной обложкой.",
    "price": 2595,
    "status": "В наличии",
    "author": "Джон Рональд Руэл Толкин",
    "category": "Фэнтези",
    "rating": 5,
    "img": "assets/images/6812020788.jpg",
    "discount": 10
  },
  {
    "id": 25,
    "title": "Сказки Волшебной страны",
    "description": "Джон P.P. Толкин – один из родоначальников жанра фэнтези, автор знаменитой трилогии \"Властелин Колец\". Вселенная Средиземья, описанная Толкиным в романах, получила гармоничное продолжение в малой прозе и стихотворениях, включенных в этот сборник.\nЦикл \"Стихи из Алой книги\" повествует о приключениях Тома Бомбадила, известного персонажа \"Хоббита\", а также знакомит читателя с волшебным миром Средиземья: с гномами, троллями, эльфами и прочими странными созданиями – персонажами легенд Старой Англии, которых гений Толкина наделяет романтическими и комическими чертами.\nТакже в сборник вошла замечательная повесть-сказка \"Роверандом\", написанная Джоном Р.Р.Толкиным для его детей в 1925 году. После успеха \"Хоббита\", в 1937 году, она была подготовлена к печати, однако увидела свет лишь в 1998 году, когда автора уже не было в живых.",
    "price": 1439,
    "status": "В наличии",
    "author": "Джон Рональд Руэл Толкин",
    "category": "Фэнтези",
    "rating": 5,
    "img": "assets/images/6011269768.jpg",
    "discount": 10
  },
  {
    "id": 26,
    "title": "Неоконченные предания Нуменора и Средиземья",
    "description": "От автора культовых бестселлеров «Властелин колец» и «Хоббит».\n«Неоконченные предания» — первый посмертный сборник работ Толкина.\nВ сентябре 2022 года состоялась премьера телесериала «Властелин колец: Кольца власти» — самого дорогого телесериала в истории.",
    "price": 1887,
    "status": "В наличии",
    "author": "Джон Рональд Руэл Толкин",
    "category": "Фэнтези",
    "rating": 5,
    "img": "assets/images/10581502_0.jpg",
    "discount": 10
  },
  {
    "id": 27,
    "title": "Дети Хурина",
    "description": "Этот роман, создававшийся параллельно с «Сильмариллионом» и «Властелином Колец», увидел свет только после смерти Джона Рональда Руэла Толкина, когда его сын Кристофер собрал и отредактировал многочисленные черновики и заметки отца. История короля Хурина и его наследника, проклятого героя Турина Турамбара, жребием коего было нести погибель всем, кого он полюбит. История черных дней эльфийских королевств Средиземья, павших под натиском сил Темного Властелина Моргота. История лучшего друга Турина – эльфийского воина Белега Куталиона – и его сестры Ниэнор. История великого подвига и великой скорби...",
    "price": 439,
    "status": "В наличии",
    "author": "Джон Рональд Руэл Толкин",
    "category": "Фэнтези",
    "rating": 5,
    "img": "assets/images/1011628324.jpg",
    "discount": 10
  },
  {
    "id": 28,
    "title": "Книга утраченных сказаний. Часть 1",
    "description": "«Книга Утраченных Сказаний» – первое серьезное художественное произведение Джона Р.Р. Толкина, начатое им в 1916 – 1917 годах, когда автору было двадцать пять лет, и оставленное незавершенным несколькими годами позже. «Утраченные Сказания» – прообраз тех мифов и легенд, что впоследствии будут названы «Сильмариллионом». «Сказания», в которых чувствуется несомненное влияние английских легенд, обрамлены историей о предпринятом мореходом Эриолом грандиозном путешествии через океан на запад, к берегам Тол Эрэссэа, Одинокого Острова, где обитают эльфы. Здесь отважный Эриол узнает истинную историю волшебного народа – Утраченные Сказания Эльфинесса.",
    "price": 1297,
    "status": "В наличии",
    "author": "Джон Рональд Руэл Толкин",
    "category": "Фэнтези",
    "rating": 5,
    "img": "assets/images/101368869_0.jpg",
    "discount": 10
  },
  {
    "id": 29,
    "title": "Книга утраченных сказаний. Часть 2",
    "description": "«Книга Утраченных Сказаний» – первое серьезное художественное произведение Джона Р.Р. Толкина, начатое им в 1916 – 1917 годах, когда автору было двадцать пять лет, и оставленное незавершенным несколькими годами позже. «Утраченные Сказания» – прообраз тех мифов и легенд, что впоследствии будут названы «Сильмариллионом». «Сказания», в которых чувствуется несомненное влияние английских легенд, обрамлены историей о предпринятом мореходом Эриолом грандиозном путешествии через океан на запад, к берегам Тол Эрэссэа, Одинокого Острова, где обитают эльфы. Здесь отважный Эриол узнает истинную историю волшебного народа – Утраченные Сказания Эльфинесса.",
    "price": 1533,
    "status": "В наличии",
    "author": "Джон Рональд Руэл Толкин",
    "category": "Фэнтези",
    "rating": 5,
    "img": "assets/images/7125063992.jpg",
    "discount": 10
  },
  {
    "id": 30,
    "title": "Ведьмак. Владычица Озера",
    "description": "Цири, наследница трона Цинтры, наследница Старшей Крови. Ты привыкла убегать. От войны. От наемных убийц. От жуткого Лео Бонарта, идущего по твоему следу. От бездушного Народа Ольх. Ускользать в последний момент, на пределах сил — через страны, миры и даже через само время. Но от кого ты бежишь на самом деле, Дитя Предназначения? И где окончится твой путь? Может, на залитых кровью ступенях замка Стигга, где ты будешь сражаться за тех, кого любишь больше всего на свете? Или на берегу озера, укутанного непроницаемым пологом тумана? Да и есть ли вообще конец этому пути? Ведь когда что-то заканчивается — что-то начинается…\nСага А. Сапковского давно занимает почетное место в мировой традиции жанра фэнтези, а Геральт стал культовым персонажем не только в мире литературы, но и в универсуме компьютерных игр. Седьмая книга из цикла «Ведьмак» впервые выходит с иллюстрациями Дениса Гордеева, созданными специально для этого издания.",
    "price": 2123,
    "status": "В наличии",
    "author": "Анджей Сапковский",
    "category": "Фэнтези",
    "rating": 4,
    "img": "assets/images/d7fb7f72-ca54-4d82-903c-a0f2dbbe7870.jpg",
    "discount": 20
  },
  {
    "id": 31,
    "title": "Гарри Поттер и философский камень",
    "description": "Книга, покорившая мир, эталон литературы для читателей всех возрастов, синоним успеха. Книга, сделавшая Джоан Роулинг самым читаемым писателем современности. Книга, ставшая культовой уже для нескольких поколений. «Гарри Поттер и Философский камень» - история начинается.",
    "price": 1356,
    "status": "В наличии",
    "author": "Джоан Кэтлин Роулинг",
    "category": "Детская художественная литература",
    "rating": 5,
    "img": "assets/images/121626.jpg",
    "discount": 15
  },
  {
    "id": 32,
    "title": "Гарри Поттер и Тайная комната",
    "description": "Книга, покорившая мир, эталон литературы для читателей всех возрастов, синоним успеха.\nКнига, сделавшая Дж.К. Роулинг самым читаемым писателем современности.\n«Гарри Поттер и Тайная комната» – история продолжается.\n\n3 причины купить:\n1. Культовая классика современной детской литературы.\n2. Книги о Гарри Поттере разошлись тиражом более 500 млн. экземпляров по всему миру.\n3. Именно благодаря этим книгам дети начинают читать, понимать и любить литературу.",
    "price": 1356,
    "status": "В наличии",
    "author": "Джоан Кэтлин Роулинг",
    "category": "Детская художественная литература",
    "rating": 5,
    "img": "assets/images/6379598186.jpg",
    "discount": 15
  },
  {
    "id": 33,
    "title": "Гарри Поттер и узник Азкабана",
    "description": "Книга, покорившая мир, эталон литературы для читателей всех возрастов, синоним успеха. Книга, сделавшая Дж.К. Роулинг самым читаемым писателем современности. Книга, ставшая культовой уже для нескольких поколений. «Гарри Поттер и узник Азкабана» – история продолжается.\n3 причины купить:\n1. Культовая классика современной детской литературы.\n2. Захватывающая история, от которой невозможно оторваться.\n3. Именно благодаря этим книгам дети начинают читать, понимать и любить литературу.",
    "price": 1356,
    "status": "В наличии",
    "author": "Джоан Кэтлин Роулинг",
    "category": "Детская художественная литература",
    "rating": 5,
    "img": "assets/images/6964302497.jpg",
    "discount": 15
  },
  {
    "id": 34,
    "title": "Гарри Поттер и Кубок Огня",
    "description": "Книга, покорившая мир, эталон литературы для читателей всех возрастов, синоним успеха. Книга, сделавшая Дж.К. Роулинг самым читаемым писателем современности. Книга, ставшая культовой уже для нескольких поколений. «Гарри Поттер и Кубок Огня» — история продолжается...\n\n3 причины купить:\n1. Культовая классика современной детской литературы.\n2. Книги о Гарри Поттере разошлись тиражом более 500 млн. экземпляров по всему миру.\n3. Именно благодаря этим книгам дети начинают читать, понимать и любить литературу.",
    "price": 1356,
    "status": "В наличии",
    "author": "Джоан Кэтлин Роулинг",
    "category": "Детская художественная литература",
    "rating": 5,
    "img": "assets/images/6536926927.jpg",
    "discount": 15
  },
  {
    "id": 35,
    "title": "Гарри Поттер и Орден Феникса",
    "description": "Книга, покорившая мир, эталон литературы для читателей всех возрастов, синоним успеха. Книга, сделавшая Дж.К. Роулинг самым читаемым писателем современности. Книга, ставшая культовой уже для нескольких поколений. «Гарри Поттер и орден Феникса» – история продолжается.\n\n3 причины купить:\n1. Культовая классика современной детской литературы.\n2. Книги о Гарри Поттере разошлись тиражом более 500 млн. экземпляров по всему миру.\n3. Именно благодаря этим книгам дети начинают читать, понимать и любить литературу.\n",
    "price": 1439,
    "status": "В наличии",
    "author": "Джоан Кэтлин Роулинг",
    "category": "Детская художественная литература",
    "rating": 5,
    "img": "assets/images/6012509599.jpg",
    "discount": 15
  },
  {
    "id": 36,
    "title": "Гарри Поттер и Принц-полукровка",
    "description": "Книга, покорившая мир, эталон литературы для читателей всех возрастов, синоним успеха. Книга, сделавшая Дж.К. Роулинг самым читаемым писателем современности. Книга, ставшая культовой уже для нескольких поколений. «Гарри Поттер и Принц-полукровка» – история продолжается.\n\n3 причины купить:\n1. Культовая классика современной детской литературы.\n2. Книги о Гарри Поттере разошлись тиражом более 500 млн. экземпляров по всему миру.\n3. Именно благодаря этим книгам дети начинают читать, понимать и любить литературу.",
    "price": 1539,
    "status": "В наличии",
    "author": "Джоан Кэтлин Роулинг",
    "category": "Детская художественная литература",
    "rating": 5,
    "img": "assets/images/6536926861.jpg",
    "discount": 15
  },
  {
    "id": 37,
    "title": "Гарри Поттер и Дары Смерти",
    "description": "Книга, покорившая мир, эталон литературы, синоним успеха. Книга, ставшая культовой уже для нескольких поколений. «Гарри Поттер и Дары Смерти» – финал истории.\n\n3 причины купить:\n1. Культовая классика современной детской литературы.\n2. Книги о Гарри Поттере разошлись тиражом более 500 млн. экземпляров по всему миру.\n3. Именно благодаря этим книгам дети начинают читать, понимать и любить литературу.",
    "price": 1639,
    "status": "В наличии",
    "author": "Джоан Кэтлин Роулинг",
    "category": "Детская художественная литература",
    "rating": 5,
    "img": "assets/images/7327795719.jpg",
    "discount": 15
  },
  {
    "id": 38,
    "title": "Сказки Барда Бидля",
    "description": "У вас в руках специальное издание «Сказок барда Бидля», знакомых всем колдунам и ведьмам с детства. Перевод с рунического сделан Гермионой Грейнджер. Автор комментариев и пояснений – самый знаменитый колдун современности, профессор Альбус Персиваль Вульфрик Брайан Думбльдор.",
    "price": 1139,
    "status": "В наличии",
    "author": "Джоан Кэтлин Роулинг",
    "category": "Детская художественная литература",
    "rating": 3,
    "img": "assets/images/dzh-k-rouling-skazki-barda-bidlya-tverdaya-obl_9127bbc439c1862_1024x3000.webp.jpg",
    "discount": 15
  },
  {
    "id": 39,
    "title": "Ходячий замок",
    "description": "Книги английской писательницы Дианы У. Джонс настолько ярки, что так и просятся на экран. По ее бестселлеру «Ходячий замок» знаменитый мультипликатор Хаяо Миядзаки («Унесенные призраками»), обладатель «Золотого льва» — высшей награды Венецианского фестиваля, снял анимационный фильм, побивший в Японии рекорд кассовых сборов.\n...Софи живет в сказочной стране, где ведьмы и русалки, семимильные сапоги и говорящие собаки — обычное дело. Поэтому, когда на нее обрушивается ужасное проклятие коварной Болотной Ведьмы, Софи ничего не остается, как обратиться за помощью к таинственному чародею Хоулу, обитающему в Ходячем замке. Однако, чтобы освободиться от чар, Софи предстоит разгадать немало загадок и прожить в замке у Хоула гораздо дольше, чем она рассчитывала. А для этого нужно подружиться с огненным демоном, поймать падающую звезду, подслушать пение русалок, отыскать мандрагору и многое, многое другое.",
    "price": 974,
    "status": "В наличии",
    "author": "Диана Джонс",
    "category": "Детская художественная литература",
    "rating": 4,
    "img": "assets/images/6ebh8wjbyvrljw7pb6ym8f2lse72jj05.jpg",
    "discount": 5
  },
  {
    "id": 40,
    "title": "Маленькая злая книга",
    "description": "Первая книга международной серии-бестселлера — только в России продано более 600 000 экземпляров! Уникальный формат, сочетающий художественный текст + квест + разнообразные задания для читателей = книга-квест. Это издание создано для тех, кто считает, что читать — это скучно. Оно не оставит никаких сомнений, что с книгами можно классно проводить время: подтверждено тысячами положительных отзывов родителей!\nСекрет успеха серии в том, что книга ведёт живой, юмористический диалог с читателем, рассказывает ему страшные истории и приглашает в авантюрное приключение. Чтобы пройти всю книгу до конца (принимая решения на сюжетных развилках и переходя по разным страницам не по порядку), нужно разгадать немало загадок и головоломок, которые развивают внимание и мышление. Поэтому «Маленькой злой книге», которая хочет стать самой злой книгой на свете, без помощи читателя никак не обойтись!",
    "price": 825,
    "status": "В наличии",
    "author": "Магнус Мист",
    "category": "Детская художественная литература",
    "rating": 3,
    "img": "assets/images/6728817670.jpg",
    "discount": 20
  },
  {
    "id": 41,
    "title": "Найти идею: Введение в ТРИЗ - теорию решения изобретательских задач",
    "description": "Введение в ТРИЗ - теорию решения изобретательских задач.\nПостичь тайну творчества пытались многие, но только Генриху Сауловичу Альтшуллеру удалось создать стройную теорию решения изобретательских задач — ТРИЗ. Изучив десятки тысяч патентов и авторских свидетельств, Альтшуллер открыл основные законы изобретательства и показал, что процесс создания изобретений управляем. Процесс изобретательства требует правильной организации мышления, преодоления психологической инерции, стремления к идеальному решению, разрешения противоречия, скрытого в любой нестандартной задаче. ТРИЗ признана во всем мире и применяется для решения творческих задач во многих областях человеческой деятельности, начиная с конструирования и проектирования и заканчивая рекламой, PR, управлением.\nКнига будет интересна всем, кто стремится повысить эффективность творчества, и будет полезна не только изобретателям и инженерам, но и бизнесменам, менеджерам, людям творческих профессий, студентам и школьникам.",
    "price": 1039,
    "status": "В наличии",
    "author": "Генрих Альтшуллер",
    "category": "Технические науки",
    "rating": 4,
    "img": "assets/images/6246109664.jpg",
    "discount": 5
  },
  {
    "id": 42,
    "title": "История инженерного дела. Важнейшие технические достижения с древних времен до ХХ столетия",
    "description": "Настоящая книга представляет собой интереснейший обзор развития инженерного искусства в истории западной цивилизации от истоков до двадцатого века. Авторы делают акцент на достижения, которые, по их мнению, являются наиболее важными и оказали наибольшее влияние на развитие человеческой цивилизации, приводя великолепные примеры шедевров творческой инженерной мысли. Это висячие сады Вавилона; строительство египетских пирамид и храмов; хитроумные механизмы Архимеда; сложнейшие конструкции трубопроводов и мостов; тоннелей, проложенных в горах и прорытых под водой; каналов; пароходов; локомотивов — словом, все то, что требует обширных технических знаний, опыта и смелости. Авторы объясняют назначение изобретений, дают подробные описания составных частей и как они взаимодействуют, сообщают основные размеры, дают представление о технологии строительства или сборки. Завершается обзор очерком о влиянии инженерии на общество, в котором утверждается, что технология должна содействовать повышению этических и эстетических ценностей.\nКнига богато иллюстрирована и написана простым доступным языком, не отягощенным большим количеством технических терминов и деталей.",
    "price": 1297,
    "status": "В наличии",
    "author": "Ричард Кирби",
    "category": "Технические науки",
    "rating": 4,
    "img": "assets/images/WV5gJVe6HvQ.jpg",
    "discount": 5
  },
  {
    "id": 43,
    "title": "Занимательная механика",
    "description": "Механика — одна из древнейших наук, известных человеку, и в то же время — наука вечно юная, интересная, удивительная и очень полезная. Мы сталкиваемся с ее проблемами каждый день, сами о том не подозревая. Замечательная книга Якова Исидоровича Перельмана предлагает читателям поближе познакомиться с этой наукой с помощью интересных задачек, примеров и парадоксов. Как пишет сам автор, «цель „Занимательной механики“ — разбудить дремлющую мысль… Это не учебник, а вольная книга, ставящая себе задачей повысить интерес к предмету занимательными сопоставлениями».",
    "price": 359,
    "status": "В наличии",
    "author": "Яков Перельман",
    "category": "Технические науки",
    "rating": 4,
    "img": "assets/images/6832730093.jpg",
    "discount": 5
  },
  {
    "id": 44,
    "title": "Будущее наступило: большая книга прогнозов",
    "description": "Комплект «Будущее наступило: большая книга прогнозов» содержит 3 книги, посвященных техническому прогрессу и рисам, связанным с ним. Набор станет отличным подарком для будущих инженеров и конструкторов. Из книг вы узнаете всю правду о роботах от ведущих мировых специалистов, полную историю автостроения, что такое глобальная сеть и как она относится к человеку. Окунитесь в кибермир будущего!",
    "price": 1533,
    "status": "В наличии",
    "author": "Рут Айлетт, Джон Бентли, Патрисия А. Варгас",
    "category": "Технические науки",
    "rating": 4,
    "img": "assets/images/3376164.jpg",
    "discount": 15
  },
  {
    "id": 45,
    "title": "Инженерная графика: учеб. пособие",
    "description": "Учебное пособие соответствует программе курса \"Инженерная графика\", утвержденной Федеральным агентством по образованию РФ. Материал изложен в соответствии с ЕСКД и государственными стандартами РФ. Содержит основные правила выполнения и оформления машиностроительных чертежей и схем, а также справочные данные. .Предназначено для студентов машиностроительных специальностей очной и заочной форм обучения.",
    "price": 365,
    "status": "В наличии",
    "author": "Ирина Скобелева",
    "category": "Технические науки",
    "rating": 4,
    "img": "assets/images/cover.jpg",
    "discount": 5
  },
  {
    "id": 46,
    "title": "Алгоритмизация в инженерных задачах",
    "description": "Описаны основные конструкции языка программирования высокого уровня С++. Рассмотрены численные методы и алгоритмы их программирования для решения инженерных и прикладных задач. Для студентов направлений подготовки 15.03.04 \"Автоматизация технологических процессов и производств\", 15.03.06 \"Мехатроника и робототехника\" и 27.03.04 \"Управление в технических системах\".",
    "price": 2123,
    "status": "В наличии",
    "author": "Сергей Съянов",
    "category": "Технические науки",
    "rating": 4,
    "img": "assets/images/6794447490.jpg",
    "discount": 5
  },
  {
    "id": 47,
    "title": "Сопротивление материалов с компьютерными расчетами",
    "description": "Данное учебное пособие ориентировано на использование компьютерных технологий в прочностных расчетах конструкций. Для сравнительно простых расчетов и решения всевозможных уравнений, как правило, используется Mathcad. Для сложных комплексных расчетов конструкций используются современные вычислительные комплексы, использующие метод конечных элементов. Для подготовки студентов к изменившимся условиям работы уже при изучении курса сопротивления материалов нужно знакомить их с компьютерными методами расчета. Первая часть – традиционный курс сопротивления материалов. Каждый раздел дополнен современными сведениями из смежных научных областей. Вторая часть – метод конечных элементов (МКЭ). Не претендуя на полноту изложения, этот раздел содержит все сведения, необходимые для использования вычислительных комплексов. Заканчивается раздел знакомством с популярными вычислительными комплексами ANSYS, COSMOS/Works и ZENIT. Для студентов инженерных специальностей вузов и инженеров.",
    "price": 2949,
    "status": "В наличии",
    "author": "Евгений Макаров",
    "category": "Технические науки",
    "rating": 4,
    "img": "assets/images/soprotivleniematerialovskompyuternymiraschetami7_1734564982.jpg",
    "discount": 5
  },
  {
    "id": 48,
    "title": "Основы теоретической механики",
    "description": "Отражены основные вопросы теоретической механики. Большое внимание уделено теоретическим вопросам основных разделов теоретической механики - статики, кинематики и динамики. Рассмотрены условия равновесия абсолютно твёрдых тел и их систем. Дана теория для различных способов решения задач по теме плоскопараллельного движения абсолютно твёрдого тела. Приведена авторская теорема о проекциях векторов ускорений двух точек абсолютно твёрдого тела, совершающего плоскопараллельное движение, на прямую, повернутую относительно прямой, соединяющей эти точки на определённый угол, по представленной формуле. Рассмотрены основные теоремы динамики материальной точки и системы материальных точек.\nДля студентов СПО и ВПО, преподавателей и научных работников, интересующихся вопросами теоретической механики.",
    "price": 2123,
    "status": "В наличии",
    "author": "Денис Болдырев",
    "category": "Технические науки",
    "rating": 4,
    "img": "assets/images/cover (1).jpg",
    "discount": 5
  },
  {
    "id": 49,
    "title": "Технологии будущего",
    "description": "В книге изложена система гипотез, которая может привести к появлению теорий и технологий будущего. Новые взгляды на сущность движений и физических полей позволяют сформулировать оригинальные гипотезы о строении объектов микромира и природе гравитации, открывают возможности по созданию гравитационных устройств различного назначения. Рассмотрены современные тенденции виртуализации экономики и финансов. Описаны изобретения, позволяющие создавать самовосстанавливающиеся микросхемы и нейроинтерфейсы для управления техникой силой мысли. Представлен прогноз эволюции Интернета. .Книга призвана стимулировать решение важнейших технологических задач современности.",
    "price": 639,
    "status": "В наличии",
    "author": "Владимир Никитин",
    "category": "Технические науки",
    "rating": 4,
    "img": "assets/images/1019245801.jpg",
    "discount": 5
  },
  {
    "id": 50,
    "title": "Книга юного техника",
    "description": "Любая вещь вдвойне приятней, если она сделана своими руками. Да и починить сломавшееся изделие гораздо практичней самому. Настоящее издание предлагает подробное описание приёмов и особенностей работ с деревом, металлом, механикой, энергетикой, электро- и радиотехникой. В книге предлагаются варианты создания электрических звонков, трансформаторов, насосов, ветряных двигателей, авиационных моделей. Каждая глава сопровождается исчерпывающей информацией о материалах и их свойствах. Как работать с различными клеями? Как сделать гравировку на металле? Как сконструировать фитили для горелок и сделать обувь непромокаемой? Эти и другие полезные рецепты на разные случаи жизни собраны в этом пособии. Книга рассчитана на широкий круг читателей разных возрастов. Взрослые смогут найти здесь много советов, которые пригодятся в быту, а старшеклассники получат дополнительные знания сразу по нескольким школьным предметам.",
    "price": 801,
    "status": "В наличии",
    "author": "Л. Киселев",
    "category": "Технические науки",
    "rating": 4,
    "img": "assets/images/53f68084-b2f4-11eb-0a80-01610005f0b1_0-540x860.jpg",
    "discount": 5
  },
  {
    "id": 51,
    "title": "Грокаем алгоритмы",
    "description": "Алгоритмы — это пошаговые инструкции решения задач, большинство из которыхуже были кем-то решены, протестированы и доказали свою эффективность. Второе издание «Грокаем алгоритмы» упрощает изучение, пониманиеи использование алгоритмов. В этой книге вы найдете простые и внятные объяснения, более 400 забавных иллюстраций и десятки примеров. Ее чтение — лучшийспособ раскрыть всю мощь алгоритмов и подготовиться к интервью по программированию. Глубоких знаний математики не требуется! Вы узнаете о главных алгоритмах, позволяющих ускорить работу программ, упростить код и решить распространенные проблемы программирования.\nНачните с сортировкии поиска, а затем развивайте свои навыки для решения сложных задач, таких как сжатие данныхи искусственный интеллект. Научитесь\nсравнивать эффективность различных алгоритмов.\nВо втором издании даны новые, более подробные описания деревьев, МР-полные задачи, а код примеров обновлен на Python 3.\nПора грокать алгоритмы по-новому!",
    "price": 1436,
    "status": "В наличии",
    "author": "Адитья Бхаргава",
    "category": "Информатика",
    "rating": 5,
    "img": "assets/images/6590371350.jpg",
    "discount": 38
  },
  {
    "id": 52,
    "title": "Чистая архитектура. Искусство разработки программного обеспечения",
    "description": "\"Идеальный программист\" и \"Чистый код\" - легендарные бестселлеры Роберта Мартина - рассказывают, как достичь высот профессионализма. \"Чистая архитектура\" продолжает эту тему, но не предлагает несколько вариантов в стиле \"решай сам\", а объясняет, что именно следует делать, по какой причине и почему именно такое решение станет принципиально важным для вашего успеха. .Роберт Мартин дает прямые и лаконичные ответы на ключевые вопросы архитектуры и дизайна. \"Чистую архитектуру\" обязаны прочитать разработчики всех уровней, системные аналитики, архитекторы и каждый программист, который желает подняться по карьерной лестнице или хотя бы повлиять на людей, которые занимаются данной работой. .Все архитектуры подчиняются одним и тем же правилам! .Роберт Мартин (дядюшка Боб)",
    "price": 1592,
    "status": "В наличии",
    "author": "Роберт С. Мартин",
    "category": "Информатика",
    "rating": 5,
    "img": "assets/images/7070667225.jpg",
    "discount": 35
  },
  {
    "id": 53,
    "title": "JavaScript для начинающих. 6-е издание",
    "description": "Начните программировать на JavaScript и создайте красивый и функциональный сайт своими руками прямо сейчас!\nС этим цветным пошаговым руководством вы без труда освоите все основные функции JavaScript и сможете сразу же применить полученные знания на практике.\nМножество иллюстраций, полезных советов и предостережений на полях книги помогут вам сэкономить время и избежать ошибок при обучении, а бесплатно скачиваемые примеры кода позволят добиться максимального эффекта от обучения.\n\nЧто внутри:\n- Как добавить JavaScript на сайт?\n- Переменные и функции — что это и какие бывают?\n- Операторы и как их использовать?\n- Как создавать объекты и управлять ими?\n- Методы — как и где их применять?\n- JSON, веб-приложения и скрипты.",
    "price": 1474,
    "status": "В наличии",
    "author": "Майк МакГрат",
    "category": "Информатика",
    "rating": 5,
    "img": "assets/images/7170836872.jpg",
    "discount": 25
  },
  {
    "id": 54,
    "title": "Изучаем Python: программирование игр, визуализация данных, веб-приложения",
    "description": "«Изучаем Python» — это самое популярное в мире руководство по языку Python. Вы сможете не только максимально быстро его освоить, но и научитесь писать программы, устранять ошибки и создавать работающие приложения.\nВ первой части книги вы познакомитесь с основными концепциями программирования, такими как переменные, списки, классы и циклы, а простые упражнения приучат вас к шаблонам чистого кода. Вы узнаете, как делать программы интерактивными и как протестировать код, прежде чем добавлять в проект. Во второй части вы примените новые знания на практике и создадите три проекта: аркадную игру в стиле Space Invaders, визуализацию данных с удобными библиотеками Python и простое веб-приложение, которое можно быстро развернуть онлайн.\nРаботая с книгой, вы научитесь:\n- Использовать мощные библиотеки и инструменты Python: Pygame, Matplotlib, Plotly и Django\n- Создавать 2D-игры разной сложности, которыми можно управлять с клавиатуры и мыши\n- Создавать интерактивную визуализацию данных\n- Разрабатывать, настраивать и развертывать веб-приложения\n- Разбираться с багами и ошибками\nНовое издание было тщательно переработано и отражает последние достижения в практиках программирования на Python. Первая часть книги была дополнена новой информацией о f-строках, константах и управлении данными. Во второй части был обновлен код проектов. Структура проектов и код стали более чистыми и понятными, теперь они используют всю мощь популярных библиотек и инструментов, таких как Plotly и Django. (Полный список обновлений можно найти в предисловии.)\nЕсли вы подумываете «А не заняться ли мне программированием?», то эта книга — идеальный старт. Не нужно больше ждать! Погнали!",
    "price": 1000,
    "status": "В наличии",
    "author": "Эрик Мэтиз",
    "category": "Информатика",
    "rating": 1,
    "img": "assets/images/7332511078.jpg",
    "discount": 80
  },
  {
    "id": 55,
    "title": "Справочник PYTHON. Кратко, быстро, под рукой",
    "description": "Данный справочник содержит всю ключевую информацию о Python в удобной и наглядной форме. Структура справочника позволяет быстро и удобно находить нужную информацию, получать примеры использования тех или иных элементов и конструкций Python.\nОтдельное внимание уделено внимание таким темам, как регулярные выражения, кортежи, итераторы и генераторы, объектно-ориентированное программирование на Python.\nСправочник будет полезен всем, кто использует или изучает Python: от начинающих до профессионалов.",
    "price": 1000,
    "status": "В наличии",
    "author": "Д. Кольцов",
    "category": "Информатика",
    "rating": 1,
    "img": "assets/images/f3735b04a3a555b7add313d50ce5f337.jpg",
    "discount": 80
  },
  {
    "id": 56,
    "title": "React. Сборник рецептов",
    "description": "Книга посвящена практическому применению фреймворка React. Описано создание простых приложений и приложений со сложным интерфейсом, рассмотрены вопросы маршрутизации в приложениях и управление их состоянием. Даны примеры реализации интерактивного взаимодействия с пользователем, подключения к различным службам бэкенда, таким как REST и GraphQL, описана работа с библиотеками компонентов. Подробно рассматривается безопасность приложений, процесс их тестирования, даны советы по обеспечению доступности. Приводятся практические рекомендации по повышению производительности и созданию прогрессивных веб-приложений.",
    "price": 3067,
    "status": "В наличии",
    "author": "Дэвид Гриффитс, Дон Гриффитс",
    "category": "Информатика",
    "rating": 3,
    "img": "assets/images/6786245059.jpg",
    "discount": 10
  },
  {
    "id": 57,
    "title": "Angular для профессионалов",
    "description": "Выжмите из Angular — ведущего фреймворка для динамических приложений JavaScript — всё. Адам Фримен начинает с описания MVC и его преимуществ, затем показывает, как эффективно использовать Angular, охватывая все этапы: начиная с основ и до самых передовых возможностей, которые кроются в глубинах этого фреймворка. Каждая тема изложена четко и лаконично, снабжена большим количеством подробностей, которые позволят стать вам действительно эффективными. Наиболее важные фичи даны без излишних подробностей, но содержат всю необходимую информацию, чтобы вы смогли обойти все подводные камни.",
    "price": 3674,
    "status": "В наличии",
    "author": "Адам Фримен",
    "category": "Информатика",
    "rating": 5,
    "img": "assets/images/1600.jpg",
    "discount": 10
  },
  {
    "id": 58,
    "title": "Node.js: разработка приложений в микросервисной архитектуре с нуля",
    "description": "Базовая книга по построению микросервисной архитектуры с практическими примерами на Node.js. Также рассмотрена работа с оркестратором Kubernetes и контейнерами Docker в среде Docker Compose. Разобраны основные принципы и техники разработки распределенных систем, в частности показано, как написать и развернуть три микросервиса, управлять СУБД, настроить брокер сообщений Kafka, внедрить кэш Redis. Объяснены паттерны проектирования. Особое внимание уделено распределенным транзакциям и разворачиванию микросервисов на удаленном сервере. Показано, как обеспечить расширяемость и отказоустойчивость приложений, как успешно бороться с усложнением клиентских интерфейсов, поддерживая высокую скорость загрузки страниц и приложений и не забывая о том, чтобы сайт оставался красивым и удобным в использовании. Электронный архив на сайте издательства содержит дополнительные материалы к книге.\nДля начинающих веб-разработчиков.",
    "price": 998,
    "status": "В наличии",
    "author": "Юлия Попова",
    "category": "Информатика",
    "rating": 4,
    "img": "assets/images/101385011_0.jpg",
    "discount": 10
  },
  {
    "id": 59,
    "title": "C# на практике. Войти в IT с нуля",
    "description": "Вашему вниманию предлагается книга C# на практике. Войти в IT с нуля",
    "price": 300,
    "status": "В наличии",
    "author": "Петр Евдокимов",
    "category": "Информатика",
    "rating": 2,
    "img": "assets/images/427211.jpg",
    "discount": 10
  },
  {
    "id": 60,
    "title": "HTML и CSS. 33 урока для начинающих",
    "description": "В книге 33 иллюстрированных урока, 50 практических упражнений по разработке веб-страниц и веб-сайтов разной сложности и 40 заданий для самостоятельной работы. Дано введение в веб-разработку, раскрыты основы HTML, CSS и работы в WWW. Объяснено, как с помощью HTML структурировать и форматировать текст, размещать на веб-страницах графические изображения, аудио- и видеоролики, таблицы, гиперссылки, веб-формы с элементами управления. Рассказано, как средствами CSS оформлять веб-страницы, текст, изображения, гиперссылки, веб-формы, элементы управления, задавать фон, местоположение элементов на страницах, создавать элементы непрямоугольной формы, применять фильтры, использовать двухмерные и трехмерные преобразования, создавать анимацию. Рассмотрены вопросы адаптации страниц под мобильные устройства. Электронное приложение-архив на сайте издательства содержит коды всех примеров и учебных веб-сайтов.",
    "price": 2123,
    "status": "В наличии",
    "author": "Владимир Дронов",
    "category": "Информатика",
    "rating": 4,
    "img": "assets/images/7159736641.jpg",
    "discount": 10
  },
  {
    "id": 61,
    "title": "Искусство любить",
    "description": "Одна из самых известных работ Эриха Фромма — «Искусство любить» — посвящена непростым психологическим аспектам возникновения и сохранения человеком такого, казалось бы, простого чувства, как любовь.\nДействительно ли любовь — искусство? Если да, то она требует труда и знаний. Или это только приятное ощущение?..\nДля большинства проблема любви — это прежде всего проблема того, как быть любимым, а не того, как любить самому…",
    "price": 397,
    "status": "В наличии",
    "author": "Эрих Фромм",
    "category": "Философия",
    "rating": 4,
    "img": "assets/images/6006801744.jpg",
    "discount": 15
  },
  {
    "id": 62,
    "title": "Наедине с собой",
    "description": "«Наедине с собой. Размышления» — сборник афористических мыслей Марка Аврелия, написанный им на греческом языке (койне) в 70-е годы II века во время войны на дунайской границе. Он пользовался несомненным успехом в позднеантичное время, а в XVI веке возродился в европейских философских кругах.\nЭти личные записи отражают упорное стремление императора не только руководствоваться в своем мироощущении учением стоиков, но и развивать его дальше, назвав ведущим началом в человеке не душу, но разум, который нужно привести в согласие с природой целого, достигнув таким образом бесстрастия.",
    "price": 347,
    "status": "В наличии",
    "author": "Марк Аврелий Антонин",
    "category": "Философия",
    "rating": 4,
    "img": "assets/images/6006206992.jpg",
    "discount": 15
  },
  {
    "id": 63,
    "title": "Искусство войны с комментариями и иллюстрациями",
    "description": "Настоящая книга — известный древнекитайский трактат, посвященный военной политике. До сих пор никому еще не удалось сформулировать принципы ведения войны так же просто и афористично, как человеку, известному под псевдонимом Сунь-цзы. Его произведение является основным текстом \"школы военной философии\", оказавшим большое влияние на всё военное искусство Востока.\n\nОно учит разработке стратегии, тактике, дипломатии, самоорганизованности, умению концентрироваться на определенной задаче и успешно решать ее, вести переговоры на любом уровне, показывает, как можно перехитрить своего противника и довести начатое дело до победного конца. Этой книгой зачитывались маршал Карл Густав Маннергейм и генерал Аксель Айро. Она переведена на многие языки и изучается людьми разных профессий и разных статусов.",
    "price": 801,
    "status": "В наличии",
    "author": "Цзы Сунь",
    "category": "Философия",
    "rating": 4,
    "img": "assets/images/6040716740.jpg",
    "discount": 15
  },
  {
    "id": 64,
    "title": "Государь. О военном искусстве",
    "description": "Самым известным произведением писателя стал трактат \"Государь\", первоначально издававшийся в России под названиями \"Князь\" и \"Правитель\". Макиавелли создал учение о последовательно светском государстве, свободном от церковной морали. Он полагал, что в борьбе за упрочение государства допустимы любые средства: насилие, обман, предательство. Появившийся впоследствии термин \"макиавеллизм\" стал обозначать политику, пренебрегающую законами морали. Однако сегодня многие положения автора воспринимаются как сами собой разумеющиеся, найдя свое воплощение в истории XX века.\nВ книгу включен также блистательный трактат Никколо Макиавелли «О военном искусстве», ошеломивший современников жестким и практичным подходом не только к военной тактике, но и к стратегии.",
    "price": 376,
    "status": "В наличии",
    "author": "Никколо Макиавелли",
    "category": "Философия",
    "rating": 4,
    "img": "assets/images/9908a12a_e88b_11ec_8817_002590f365c1_06bfe23e_9d82_11ed_9062_c29ed5a0c3b1.jpg",
    "discount": 15
  },
  {
    "id": 65,
    "title": "Так говорил Заратустра",
    "description": "Трактат \"Так говорил Заратустра\" называют ницшеанской Библией.\nВ нем сформулирована излюбленая идея Ницше – идея Сверхчеловека, который является для автора нравственным образцом, смыслом существования, тем, к чему нужно стремиться.\nЧеловек же – лишь мост между животным и Сверчеловеком.\nНеобычная форма – поэтичная, афористичная – не совсем соответсвует нашим представлениям о философском трактате. Однако, вчитываясь, мы улавливаем ход мысли автора, все глубже проникаемся его идеями и убеждениями...",
    "price": 365,
    "status": "В наличии",
    "author": "Фридрих Ницше",
    "category": "Философия",
    "rating": 4,
    "img": "assets/images/6006572630.jpg",
    "discount": 15
  },
  {
    "id": 66,
    "title": "Государство",
    "description": "Диалог «Государство» занимает особое место в творчестве и мировоззрении Платона. В нем он рисует картину идеального, по его мнению, устройства жизни людей, основанного на высшей справедливости, и дает подробную характеристику основным существующим формам правления, таким, как аристократия, олигархия, тирания, демократия и другим.",
    "price": 400,
    "status": "В наличии",
    "author": "Платон",
    "category": "Философия",
    "rating": 4,
    "img": "assets/images/6272673558.jpg",
    "discount": 15
  },
  {
    "id": 67,
    "title": "О скоротечности жизни",
    "description": "Луций Анней Сенека (ок. 55 г. до н. э. — 40 г. н. э.) - древнеримский философ-стоик, учившийся ораторскому мастерству в Риме, автор речей и трагедий, философских трактатов и писем.Философские диалоги Сенеки - это наставления в стоицизме, учении о том, как достойно и осмысленно жить человеку, которому не во что верить и не на кого надеяться, это проповедь стойкости перед лицом ударов судьбы и своеобразная духовная терапия для всех нас.В сборник вошли трактаты \"О блаженной жизни\", \"О скоротечности жизни\", \"О стойкости мудреца\", \"О провидении\" и \"О гневе\"",
    "price": 388,
    "status": "В наличии",
    "author": "Луций Анней Сенека",
    "category": "Философия",
    "rating": 4,
    "img": "assets/images/6731744399.jpg",
    "discount": 15
  },
  {
    "id": 68,
    "title": "Критика чистого разума",
    "description": "«Критика чистого разума» – книга, которую каждая эпоха заново оценивает и по-своему переосмысливает.\nКнига, которая остается актуальной вот уже более двух столетий.\nКнига, которую изучали и пытались интерпретировать абсолютно все значительные философы, творившие после Канта, и которая по сей день занимает умы ученых и писателей, моралистов и политиков.\nЭто opus magnum Канта, он обдумывал этот труд десять лет – а написал за несколько месяцев. Тщательно структурированное, совершенное по форме произведение, посвященное вопросам, волновавшим лучшие умы человечества с древнейших времен, – каковы источники и границы знаний и какую роль в познании мира играют чувства, рассудок и разум.",
    "price": 471,
    "status": "В наличии",
    "author": "Иммануил Кант",
    "category": "Философия",
    "rating": 4,
    "img": "assets/images/6713199311.jpg",
    "discount": 15
  },
  {
    "id": 69,
    "title": "Этика",
    "description": "Что есть благо? Что есть счастье? Что есть добродетель?\nЧто есть свобода воли и кто отвечает за судьбу и благополучие человека?\nОб этом рассуждает сторонник разумного поведения и умеренности во всем, великий философ Аристотель.\nДо нас дошли три произведения, посвященные этике: «Евдемова этика», «Никомахова этика» и «Большая этика».\nВопрос о принадлежности этих сочинений Аристотелю все еще является предметом дискуссий.\nАвтором «Евдемовой этики» скорее всего был Евдем Родосский, ученик Аристотеля, возможно, переработавший произведение своего учителя.\n«Большая этика», которая на самом деле лишь небольшой трактат, кратко излагающий этические взгляды Аристотеля, написана перипатетиком – неизвестным учеником философа.\nИ только о «Никомаховой этике» можно с уверенностью говорить, что ее автором был сам великий мыслитель.\nПоследние два произведения и включены в предлагаемый сборник, причем \"Никомахова этика\" публикуется в переводе Э. Радлова, не издававшемся ни в СССР, ни в современной России.",
    "price": 388,
    "status": "В наличии",
    "author": "Аристотель",
    "category": "Философия",
    "rating": 4,
    "img": "assets/images/101084086_0.jpg",
    "discount": 15
  },
  {
    "id": 70,
    "title": "Беседы и суждения",
    "description": "\"Беседы и суждения\" (\"Лунь-юй\") – главная книга конфуцианства и всей китайской культуры. Многие века этот трактат считался обязательным для заучивания в классическом образовании Поднебесной.\nНа русский язык «Лунь-юй» перевел в 1910 году Павел Степанович Попов, крупнейший российский китаист своего времени, переводчик многих сочинений древнекитайских философов и составитель русско-китайского словаря, служивший в дипломатической миссии в Пекине. Его перевод отличается точностью, выразительностью и близостью к оригиналу.",
    "price": 347,
    "status": "В наличии",
    "author": "Конфуций",
    "category": "Философия",
    "rating": 4,
    "img": "assets/images/6675947176.jpg",
    "discount": 15
  },
  {
    "id": 71,
    "title": "Как управлять вселенной не привлекая внимания санитаров",
    "description": "Крутая Книга",
    "price": 1999999,
    "status": "Нет в наличии",
    "author": "Нагибин Евгений Александрович",
    "category": "Философия",
    "rating": 5,
    "img": "assets/images/h0slAnmF_dJvdOugMx5c9wr9mxwMYu0N3dBehgidUhVXsbiVXEVq--P_NJaTvkgPjf1XkQ-np17Rn-oLxFt6VxHr.jpg",
    "discount": 0
  }
]
